emas/loadtest/emas-performance-report/raw_data/sp4/apache_bench_data/250cus/varnish_ab_test_250_1000000.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking qap.everythingscience.co.za (be patient)


Server Software:        Zope/(2.13.15,
Server Hostname:        qap.everythingscience.co.za
Server Port:            80

Document Path:          /portal_css/Sunburst%20Theme/public-cachekey-4fff4ed932d766e26813993d85f43eea.css
Document Length:        31966 bytes

Concurrency Level:      250
Time taken for tests:   2793.090 seconds
Complete requests:      1000000
Failed requests:        0
Write errors:           0
Total transferred:      32552000000 bytes
HTML transferred:       31966000000 bytes
Requests per second:    358.03 [#/sec] (mean)
Time per request:       698.272 [ms] (mean)
Time per request:       2.793 [ms] (mean, across all concurrent requests)
Transfer rate:          11381.32 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        3  233  25.6    225    1212
Processing:   149  465  28.1    474    2522
Waiting:        3  235  25.5    227     910
Total:        157  698  12.8    698    2673

Percentage of the requests served within a certain time (ms)
  50%    698
  66%    699
  75%    700
  80%    700
  90%    701
  95%    703
  98%    704
  99%    706
 100%   2673 (longest request)