emas/loadtest/emas-performance-report/raw_data/sp4/apache_bench_data/250cus/varnish_ab_test_250_250.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking qap.everythingscience.co.za (be patient)


Server Software:        Zope/(2.13.15,
Server Hostname:        qap.everythingscience.co.za
Server Port:            80

Document Path:          /portal_css/Sunburst%20Theme/public-cachekey-4fff4ed932d766e26813993d85f43eea.css
Document Length:        31966 bytes

Concurrency Level:      250
Time taken for tests:   0.987 seconds
Complete requests:      250
Failed requests:        0
Write errors:           0
Total transferred:      8138000 bytes
HTML transferred:       7991500 bytes
Requests per second:    253.28 [#/sec] (mean)
Time per request:       987.050 [ms] (mean)
Time per request:       3.948 [ms] (mean, across all concurrent requests)
Transfer rate:          8051.53 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        3    5   1.5      6       8
Processing:    60  485 234.7    452     976
Waiting:        3  280 289.0    166     913
Total:         68  491 233.3    457     979

Percentage of the requests served within a certain time (ms)
  50%    457
  66%    518
  75%    551
  80%    570
  90%    944
  95%    961
  98%    974
  99%    976
 100%    979 (longest request)